This notebook is an exercise in data cleaning using Python and pandas.
I’ll work with a synthetic dataset (customers.csv) that contains messy, inconsistent data.
My goal is to identify and correct null values, adjust data types where needed, standardize column names and text fields, remove duplicates, and validate the final dataset to ensure it’s ready for analysis.

In [83]:
#import libraries
import pandas as pd
import numpy as np

#bring in file
customers=pd.read_csv('customers.csv')

#print first few rows
print(customers.head())

   customer_id         name              email   age country     signup_date  \
0            1   John Smith  user1@example.com   NaN  canada      10-03-2020
1            2  Emily Clark  user2@example.com   NaN      uk      2021-01-05
2            3   Zoe Brooks  user3@example.com  35.0      US      2021-01-05
3            4     Alex Kim  user4@example.com  30.0  canada      03-15-2021
4            5     Jane Doe                NaN  35.0     CAN  March 14, 2020

           spend
0         $99.99
1            NaN
2         $99.99
3            200
4  Three hundred

In [84]:
#standardize column names and remove white space
customers.columns = customers.columns.str.lower().str.strip()

#see current datatypes
print(customers.dtypes)

customer_id      int64
name            object
email           object
age            float64
country         object
signup_date     object
spend           object
dtype: object

In [85]:
#convert signup date to datetime
customers['signup_date'] = pd.to_datetime(customers['signup_date'], errors='coerce')

#convert string value to number string, convert to float
customers['spend'] = customers['spend'].replace('Three hundred', '300')
customers['spend'] = (
    customers['spend']
    .replace('[$,]', '', regex=True)   # remove dollar signs/commas
    .astype(float)
)

customers.dtypes

customer_id             int64
name                   object
email                  object
age                   float64
country                object
signup_date    datetime64[ns]
spend                 float64
dtype: object

In [86]:
#handle missing values
customers['email'] = customers['email'].fillna('unknown')
customers['age'] = customers['age'].fillna(customers['age'].median())
customers['spend'] = customers['spend'].fillna(0)
customers['signup_date'] = customers['signup_date'].fillna(pd.to_datetime('2020-01-01'))

In [87]:
#standardize text data
customers['country'] = customers['country'].str.upper().replace({'USA': 'US', 'CANADA': 'CA', 'UNITED KINGDOM': 'UK'})
customers['email'] = customers['email'].str.lower()

customers['country'].unique()

customers.head()

,customer_id,name,email,age,country,signup_date,spend
0,1,John Smith,user1@example.com,30.0,CA,2020-10-03,99.99
1,2,Emily Clark,user2@example.com,30.0,UK,2020-01-01,0.00
2,3,Zoe Brooks,user3@example.com,35.0,US,2020-01-01,99.99
3,4,Alex Kim,user4@example.com,30.0,CA,2021-03-15,200.00
4,5,Jane Doe,unknown,35.0,CAN,2020-01-01,300.00

In [88]:
#drop dupes
customers = customers.drop_duplicates()

In [89]:
#final look at data
customers.describe()

       customer_id        age          signup_date        spend
count    24.000000  24.000000                   24    24.000000
mean     12.500000  31.875000  2020-06-16 06:00:00   335.415417
min       1.000000  25.000000  2020-01-01 00:00:00     0.000000
25%       6.750000  30.000000  2020-01-01 00:00:00   174.997500
50%      12.500000  30.000000  2020-01-01 00:00:00   300.000000
75%      18.250000  35.000000  2020-11-12 18:00:00   400.000000
max      24.000000  40.000000  2021-03-15 00:00:00  1000.000000
std       7.071068   4.618606                  NaN   293.584293

In [90]:
print(customers)

    customer_id           name               email   age country signup_date  \
0             1     John Smith   user1@example.com  30.0      CA  2020-10-03
1             2    Emily Clark   user2@example.com  30.0      UK  2020-01-01
2             3     Zoe Brooks   user3@example.com  35.0      US  2020-01-01
3             4       Alex Kim   user4@example.com  30.0      CA  2021-03-15
4             5       Jane Doe             unknown  35.0     CAN  2020-01-01
5             6     Ryan Scott   user6@example.com  25.0      US  2020-10-03
6             7    Chris Evans   user7@example.com  30.0      UK  2020-01-01
7             8       Mary Lee   user8@example.com  30.0      UK  2021-03-15
8             9    Emily Clark   user9@example.com  30.0      CA  2020-01-01
9            10   Daniel Adams             unknown  30.0     CAN  2021-03-15
10           11     John Smith  user11@example.com  35.0      CA  2020-01-01
11           12    Laura Green  user12@example.com  40.0      US  2020-01-01
12           13     Nina Patel  user13@example.com  30.0      CA  2020-01-01
13           14    Chris Evans  user14@example.com  40.0      UK  2020-01-01
14           15     Zoe Brooks             unknown  40.0      UK  2021-03-15
15           16  Michael Davis  user16@example.com  30.0      UK  2020-10-03
16           17     John Smith  user17@example.com  25.0      UK  2020-10-03
17           18     John Smith  user18@example.com  30.0      CA  2020-01-01
18           19     Ethan Hall  user19@example.com  30.0      UK  2020-10-03
19           20     Ryan Scott             unknown  30.0      US  2021-03-15
20           21      Lisa Wong  user21@example.com  25.0      UK  2021-03-15
21           22    Emily Clark  user22@example.com  30.0      US  2020-01-01
22           23    Laura Green  user23@example.com  35.0      UK  2020-01-01
23           24     Nina Patel  user24@example.com  40.0      UK  2020-01-01

      spend
0     99.99
1      0.00
2     99.99
3    200.00
4    300.00
5    300.00
6    250.00
7    500.00
8    300.00
9    200.00
10  1000.00
11   400.00
12   400.00
13   500.00
14   400.00
15   300.00
16  1000.00
17   300.00
18   200.00
19  1000.00
20    99.99
21     0.00
22   200.00
23     0.00